# Cleaning and transforming data with Pandas 


# The main objective is to train a predictive model which allows the company to maximize the profit of the next marketing campaign. 
# Boost the profit of a marketing campaign
# The objective is to predict who will respond to an offer for a product or service

# importing numpy and pandas

In [730]:
import numpy as np

In [731]:
import pandas  as pd

In [732]:
from datetime import date

# reading the csv file

In [733]:
campaign= pd.read_csv(r'C:\Users\godwi\OneDrive\SQL Datasets\PostgresSQL\Marketing Campaign\marketing_campaign_data.csv', index_col= 'ID')

In [734]:
campaign

,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,MntFruits,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
ID,,,,,,,,,,,,,,,,,,,,,
5524,1957,Graduation,Single,58138.0,0,0,9/4/2012,58,635,88,...,7,0,0,0,0,0,0,3,11,1
2174,1954,Graduation,Single,46344.0,1,1,3/8/2014,38,11,1,...,5,0,0,0,0,0,0,3,11,0
4141,1965,Graduation,Together,71613.0,0,0,8/21/2013,26,426,49,...,4,0,0,0,0,0,0,3,11,0
6182,1984,Graduation,Together,26646.0,1,0,2/10/2014,26,11,4,...,6,0,0,0,0,0,0,3,11,0
5324,1981,PhD,Married,58293.0,1,0,1/19/2014,94,173,43,...,5,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10870,1967,Graduation,Married,61223.0,0,1,6/13/2013,46,709,43,...,5,0,0,0,0,0,0,3,11,0
4001,1946,PhD,Together,64014.0,2,1,6/10/2014,56,406,0,...,7,0,0,0,1,0,0,3,11,0
7270,1981,Graduation,Divorced,56981.0,0,0,1/25/2014,91,908,48,...,6,0,1,0,0,0,0,3,11,0
8235,1956,Master,Together,69245.0,0,1,1/24/2014,8,428,30,...,3,0,0,0,0,0,0,3,11,0
9405,1954,PhD,Married,52869.0,1,1,10/15/2012,40,84,3,...,7,0,0,0,0,0,0,3,11,1

In [735]:
# validate the number of rows and columns
campaign.shape

(2240, 28)

# Checking the dataframe's date type to ascertaing NaN ie wihtout values or unique/ duplicates

In [736]:
print(campaign.info() ) # check our datatypes

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2240 entries, 5524 to 9405
Data columns (total 28 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Year_Birth           2240 non-null   int64
 1   Education            2240 non-null   object
 2   Marital_Status       2240 non-null   object
 3   Income               2216 non-null   float64
 4   Kidhome              2240 non-null   int64
 5   Teenhome             2240 non-null   int64
 6   Dt_Customer          2240 non-null   object
 7   Recency              2240 non-null   int64
 8   MntWines             2240 non-null   int64
 9   MntFruits            2240 non-null   int64
 10  MntMeatProducts      2240 non-null   int64
 11  MntFishProducts      2240 non-null   int64
 12  MntSweetProducts     2240 non-null   int64
 13  MntGoldProds         2240 non-null   int64
 14  NumDealsPurchases    2240 non-null   int64
 15  NumWebPurchases      2240 non-null   int64
 16  NumCatalogPurchases  2240 non-null   int64
 17  NumStorePurchases    2240 non-null   int64
 18  NumWebVisitsMonth    2240 non-null   int64
 19  AcceptedCmp3         2240 non-null   int64
 20  AcceptedCmp4         2240 non-null   int64
 21  AcceptedCmp5         2240 non-null   int64
 22  AcceptedCmp1         2240 non-null   int64
 23  AcceptedCmp2         2240 non-null   int64
 24  Complain             2240 non-null   int64
 25  Z_CostContact        2240 non-null   int64
 26  Z_Revenue            2240 non-null   int64
 27  Response             2240 non-null   int64
dtypes: float64(1), int64(24), object(3)
memory usage: 507.5+ KB
None

In [737]:
campaign.isna().sum()  # check the number of NaN on columns

Year_Birth              0
Education               0
Marital_Status          0
Income                 24
Kidhome                 0
Teenhome                0
Dt_Customer             0
Recency                 0
MntWines                0
MntFruits               0
MntMeatProducts         0
MntFishProducts         0
MntSweetProducts        0
MntGoldProds            0
NumDealsPurchases       0
NumWebPurchases         0
NumCatalogPurchases     0
NumStorePurchases       0
NumWebVisitsMonth       0
AcceptedCmp3            0
AcceptedCmp4            0
AcceptedCmp5            0
AcceptedCmp1            0
AcceptedCmp2            0
Complain                0
Z_CostContact           0
Z_Revenue               0
Response                0
dtype: int64

# To Tranform and clean data - to make sense of it

In [738]:
# convert Year_Birth to age

In [739]:
# creating the date object of today's date
todays_date = date.today()
  
# printing todays date
print("Current date: ", todays_date)
  
# fetching the current year, month and day of today
print("Current year:", todays_date.year)
print("Current month:", todays_date.month)
print("Current day:", todays_date.day)

Current date:  2022-04-11
Current year: 2022
Current month: 4
Current day: 11

In [740]:
campaign.rename(columns ={'Year_Birth' : 'YoB'}, inplace = True)

In [741]:
age = todays_date.year - campaign.YoB

In [742]:
age = [2020 -i for i in campaign.YoB.values]

In [743]:
campaign['age']= [2020 -i for i in campaign.YoB.values]

In [744]:
# Validating the new age column created
campaign.loc[:,['age']]    .head(5)

      age
ID
5524   63
2174   66
4141   55
6182   36
5324   39

# Create a new column to group marital status into single and couple

In [745]:
# group marital status by couple and single
Married_Y_N = []
for i in campaign.Marital_Status.values:
    if i in ('Absurd' , 'Alone', 'Divorced', 'Single', 'Widow', 'YOLO'):
        Married_Y_N.append('Single')
    else:
        Married_Y_N.append('Couple')

In [746]:
campaign['Married_Y_N'] = Married_Y_N  # assign values to a new column  Married_Y_N

In [747]:
# Validating the new maried_Y_N column created
campaign.loc[:,['Married_Y_N']].head(5)

     Married_Y_N
ID
5524      Single
2174      Single
4141      Couple
6182      Couple
5324      Couple

# Create a new column to group number of kids into has kids or No kids

In [748]:
sum_of_kids = campaign.Kidhome.values + campaign.Teenhome.values # First sum up all kids columns

In [749]:
sum_of_kids

array([0, 2, 0, ..., 0, 1, 2], dtype=int64)

In [750]:

has_kids = []
for k in sum_of_kids:
    if k == 0:
        has_kids.append('No kid')
    else:
        has_kids.append('has_kid')

In [751]:
has_kids =  ['No Kids' if k ==0 else 'has kids' for k in sum_of_kids] # iterate to get the has_kids

In [752]:
campaign['has_kids'] = has_kids

In [753]:
# Validating the new maried_Y_N column created
campaign.loc[: ,['has_kids']].head(5)

      has_kids
ID
5524   No Kids
2174  has kids
4141   No Kids
6182  has kids
5324  has kids

# Group or sum up the six products for each user

In [754]:
# find the sum of amount spent on the 6 items
items_sum = campaign.MntWines.values + campaign.MntFruits.values + \
campaign.MntMeatProducts.values +campaign.MntFishProducts.values + \
campaign.MntSweetProducts.values + campaign.MntGoldProds.values

In [755]:
items_sum

array([1617,   27,  776, ..., 1241,  843,  172], dtype=int64)

In [756]:
# add a column for the Amount_product
campaign['Amount_spent'] = items_sum

In [757]:
campaign.loc[:, ['Amount_spent']].head()

      Amount_spent
ID
5524          1617
2174            27
4141           776
6182            53
5324           422

In [758]:
campaign.loc[5524: ,['age']]

       age
ID
5524    63
2174    66
4141    55
6182    36
5324    39
...    ...
10870   53
4001    74
7270    39
8235    64
9405    66

[2240 rows x 1 columns]

In [759]:
campaign_clean = campaign.loc[5524: ,['age','Income','Dt_Customer','Education', 
                                      'has_kids','Amount_spent','Recency','NumDealsPurchases','NumWebPurchases',
                                      'NumCatalogPurchases', 'NumStorePurchases','NumWebVisitsMonth']]

In [760]:
campaign_clean.sort_values(by =['Amount_spent'], ascending = False )
# DtCustomer - date of customer’s enrolment with the company
# Recency - number of days since the last purchase

,age,Income,Dt_Customer,Education,has_kids,Amount_spent,Recency,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth
ID,,,,,,,,,,,,
5350,29,90638.0,2/13/2014,Master,No Kids,2525,29,1,3,4,10,1
5735,29,90638.0,2/13/2014,Master,No Kids,2525,29,1,3,4,10,1
1763,32,87679.0,7/27/2013,Graduation,No Kids,2524,62,1,7,11,10,4
4580,51,75759.0,10/25/2013,Graduation,No Kids,2486,46,1,9,7,9,5
4475,71,69098.0,2/16/2013,PhD,No Kids,2440,82,1,7,8,9,5
...,...,...,...,...,...,...,...,...,...,...,...,...
11181,71,156924.0,8/29/2013,PhD,No Kids,8,85,0,0,0,0,0
10104,46,33590.0,11/3/2013,Graduation,has kids,8,65,1,1,0,2,7
3955,55,4861.0,6/22/2014,Graduation,No Kids,6,20,0,0,0,0,14
5555,45,153924.0,2/7/2014,Graduation,No Kids,6,81,0,0,0,0,0
11110,47,3502.0,4/13/2013,Graduation,has kids,5,56,0,0,0,0,14

In [761]:
campaign_clean =campaign_clean.rename(columns = {'NumStorePurchases': 'StorePpurchase',
                                 'NumDealsPurchases':'DealPurchase' , 'NumWebPurchases' :'WebPurchases',
                                'NumCatalogPurchases' : 'CatalogPurchases'})

In [762]:
campaign_clean

,age,Income,Dt_Customer,Education,has_kids,Amount_spent,Recency,DealPurchase,WebPurchases,CatalogPurchases,StorePpurchase,NumWebVisitsMonth
ID,,,,,,,,,,,,
5524,63,58138.0,9/4/2012,Graduation,No Kids,1617,58,3,8,10,4,7
2174,66,46344.0,3/8/2014,Graduation,has kids,27,38,2,1,1,2,5
4141,55,71613.0,8/21/2013,Graduation,No Kids,776,26,1,8,2,10,4
6182,36,26646.0,2/10/2014,Graduation,has kids,53,26,2,2,0,4,6
5324,39,58293.0,1/19/2014,PhD,has kids,422,94,5,5,3,6,5
...,...,...,...,...,...,...,...,...,...,...,...,...
10870,53,61223.0,6/13/2013,Graduation,has kids,1341,46,2,9,3,4,5
4001,74,64014.0,6/10/2014,PhD,has kids,444,56,7,8,2,5,7
7270,39,56981.0,1/25/2014,Graduation,No Kids,1241,91,1,2,3,13,6
8235,64,69245.0,1/24/2014,Master,has kids,843,8,2,6,5,10,3
9405,66,52869.0,10/15/2012,PhD,has kids,172,40,3,3,1,4,7

In [763]:
campaign_clean.describe()

,age,Income,Amount_spent,Recency,DealPurchase,WebPurchases,CatalogPurchases,StorePpurchase,NumWebVisitsMonth
count,2240.000000,2216.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000
mean,51.194196,52247.251354,605.798214,49.109375,2.325000,4.084821,2.662054,5.790179,5.316518
std,11.984069,25173.076661,602.249288,28.962453,1.932238,2.778714,2.923101,3.250958,2.426645
min,24.000000,1730.000000,5.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,43.000000,35303.000000,68.750000,24.000000,1.000000,2.000000,0.000000,3.000000,3.000000
50%,50.000000,51381.500000,396.000000,49.000000,2.000000,4.000000,2.000000,5.000000,6.000000
75%,61.000000,68522.000000,1045.500000,74.000000,3.000000,6.000000,4.000000,8.000000,7.000000
max,127.000000,666666.000000,2525.000000,99.000000,15.000000,27.000000,28.000000,13.000000,20.000000

In [764]:
# age , the Mean is just one point greater than median, almost perfectly symmetrical
# income , the mean

In [808]:
campaign_clean.Recency > 50

ID
5524      True
2174     False
4141     False
6182     False
5324      True
         ...
10870    False
4001      True
7270      True
8235     False
9405     False
Name: Recency, Length: 2240, dtype: bool

In [816]:
campaign_clean[(campaign_clean.Education == 'Master') | (campaign_clean.has_kids == 'No kids') ]

,age,Income,Dt_Customer,Education,has_kids,Amount_spent,Recency,DealPurchase,WebPurchases,CatalogPurchases,StorePpurchase,NumWebVisitsMonth
ID,,,,,,,,,,,,
7446,53,62513.0,9/9/2013,Master,has kids,716,16,2,6,4,10,6
8180,68,59354.0,11/15/2013,Master,has kids,310,53,3,6,1,5,6
6565,71,76995.0,3/28/2013,Master,has kids,1782,91,2,11,4,9,5
6864,31,10979.0,5/22/2014,Master,No Kids,30,34,2,3,0,3,5
3033,57,38620.0,5/11/2013,Master,No Kids,318,56,1,2,5,3,3
...,...,...,...,...,...,...,...,...,...,...,...,...
9246,35,40101.0,10/14/2012,Master,has kids,415,73,4,6,1,6,7
7366,38,75777.0,7/4/2013,Master,No Kids,1438,12,1,3,6,11,1
1448,57,33562.0,6/25/2014,Master,has kids,51,33,3,2,0,4,4
9817,50,44802.0,8/21/2012,Master,No Kids,1049,71,2,9,4,12,8
8235,64,69245.0,1/24/2014,Master,has kids,843,8,2,6,5,10,3

In [817]:
campaign_clean.loc[(campaign_clean.Education == 'Master') | (campaign_clean.has_kids == 'No kids') ]

,age,Income,Dt_Customer,Education,has_kids,Amount_spent,Recency,DealPurchase,WebPurchases,CatalogPurchases,StorePpurchase,NumWebVisitsMonth
ID,,,,,,,,,,,,
7446,53,62513.0,9/9/2013,Master,has kids,716,16,2,6,4,10,6
8180,68,59354.0,11/15/2013,Master,has kids,310,53,3,6,1,5,6
6565,71,76995.0,3/28/2013,Master,has kids,1782,91,2,11,4,9,5
6864,31,10979.0,5/22/2014,Master,No Kids,30,34,2,3,0,3,5
3033,57,38620.0,5/11/2013,Master,No Kids,318,56,1,2,5,3,3
...,...,...,...,...,...,...,...,...,...,...,...,...
9246,35,40101.0,10/14/2012,Master,has kids,415,73,4,6,1,6,7
7366,38,75777.0,7/4/2013,Master,No Kids,1438,12,1,3,6,11,1
1448,57,33562.0,6/25/2014,Master,has kids,51,33,3,2,0,4,4
9817,50,44802.0,8/21/2012,Master,No Kids,1049,71,2,9,4,12,8
8235,64,69245.0,1/24/2014,Master,has kids,843,8,2,6,5,10,3

# Fancing Indexing wiht Lookup

In [827]:
campaign_clean.loc[[ 2174,5524] , ( 'Education' , 'Recency')]

       Education  Recency
ID
2174  Graduation       38
5524  Graduation       58

In [832]:
campaign_clean.iloc[0: , 0:]

,age,Income,Dt_Customer,Education,has_kids,Amount_spent,Recency,DealPurchase,WebPurchases,CatalogPurchases,StorePpurchase,NumWebVisitsMonth
ID,,,,,,,,,,,,
5524,63,58138.0,9/4/2012,Graduation,No Kids,1617,58,3,8,10,4,7
2174,66,46344.0,3/8/2014,Graduation,has kids,27,38,2,1,1,2,5
4141,55,71613.0,8/21/2013,Graduation,No Kids,776,26,1,8,2,10,4
6182,36,26646.0,2/10/2014,Graduation,has kids,53,26,2,2,0,4,6
5324,39,58293.0,1/19/2014,PhD,has kids,422,94,5,5,3,6,5
...,...,...,...,...,...,...,...,...,...,...,...,...
10870,53,61223.0,6/13/2013,Graduation,has kids,1341,46,2,9,3,4,5
4001,74,64014.0,6/10/2014,PhD,has kids,444,56,7,8,2,5,7
7270,39,56981.0,1/25/2014,Graduation,No Kids,1241,91,1,2,3,13,6
8235,64,69245.0,1/24/2014,Master,has kids,843,8,2,6,5,10,3
9405,66,52869.0,10/15/2012,PhD,has kids,172,40,3,3,1,4,7

In [839]:
# create a df

age = [20,34,56,50,30] 
name = ['Joy' , 'Harry' , 'Godwin' , 'Yemi' , 'Bisi']
score = [10,23,45,34,56]

In [853]:
clubhouse = pd.DataFrame({'age' : age , 'names' : name ,'scores' : score })

In [854]:
clubhouse

   age   names  scores
0   20     Joy      10
1   34   Harry      23
2   56  Godwin      45
3   50    Yemi      34
4   30    Bisi      56

In [875]:
clubhouse['hobby'] = ['sports', 'hiking', 'chess' , 'hunting', 'music']

In [876]:
clubhouse

   age   names  scores    hobby  avg_age
0   20     Joy      10   sports     10.0
1   34   Harry      23   hiking     17.0
2   56  Godwin      45    chess     28.0
3   50    Yemi      34  hunting     25.0
4   30    Bisi      56    music     15.0

In [885]:
clubhouse.age.mean()

38.0

In [886]:
clubhouse['avg_age'] = [i/2 for i in age]

In [889]:
clubber = clubhouse.append({'age': 40 , 'names': 'Jeremy' , 'scores': 120 , 'hobby' : 'movies' ,  },\
                 ignore_index = True).fillna(0)

In [890]:
clubber

   age   names  scores    hobby  avg_age
0   20     Joy      10   sports     10.0
1   34   Harry      23   hiking     17.0
2   56  Godwin      45    chess     28.0
3   50    Yemi      34  hunting     25.0
4   30    Bisi      56    music     15.0
5   40  Jeremy     120   movies      0.0

In [896]:
clubber.drop('avg_age', axis = 1)

   age   names  scores    hobby
0   20     Joy      10   sports
1   34   Harry      23   hiking
2   56  Godwin      45    chess
3   50    Yemi      34  hunting
4   30    Bisi      56    music
5   40  Jeremy     120   movies

In [898]:
clubber = clubber .append({'age': 40 , 'names': 'Jeremy' , 'scores': 120 , 'hobby' : 'movies' ,  },\
                 ignore_index = True).fillna(0)

In [914]:
clubber

0    10
1    17
2    28
3    25
4    15
5     0
6     0
Name: avg_age, dtype: int32

In [912]:
clubber = clubber.avg_age.astype(int)

In [913]:
clubber

0    10
1    17
2    28
3    25
4    15
5     0
6     0
Name: avg_age, dtype: int32